Revit 2026 API

# MaterialTransparency Property

---

The transparency of the material.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int Transparency { get; set; }
```
```vb
Public Property Transparency As Integer
	Get
	Set
```
```cpp
public:
property int Transparency {
	int get ();
	void set (int value);
}
```
```fsharp
member Transparency : int with get, set
```

#### Property Value

Int32 The value ranges from 0 to 100.

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: values for shininess must be between 0 and 128 |

#### Reference

Material Class

Autodesk.Revit.DB Namespace